<template>
  <v-container class="fill-height">
    <v-card variant="tonal" class="pa-2">
      <div class="text-subtitle-2 pb-2">ПРИЛОЖЕНИЕ</div>
      <v-list density="compact">
        <v-list-item-title>
          Разработать адаптивное приложение для десктоп и мобильных платформ, состоящие из:
        </v-list-item-title>
        <v-list-item>
          1) Хедера. В хедере добавить произвольный логотип и меню для двух страниц(Настройки / Order Book).
        </v-list-item>
        <v-list-item>
          2) Области для отрисовки страниц. Страницы должны подгружаться динамически отдельными чанками по мере
          необходимости.
        </v-list-item>
        <v-list-item>
          3) Бизнес логики, работы с api и данными, вынесенными в стор и разбитыми на модули.
        </v-list-item>
        <v-list-item>
          4) В качестве ui библиотки желательно использовать vuetify, именование классов если потребуется реализовать по
          БЭМу
        </v-list-item>
      </v-list>

      <div class="text-subtitle-2 py-2">ДАННЫЕ</div>
      <v-list density="compact">
        <v-list-item>
          В качестве источника данных необходимых для реализации страниц используем api Binance. А именно 2 метода:
          получить
          биржевой стакан по определенной валютной паре по REST и подписаться на обновления стакана по WS.
        </v-list-item>
        <v-list-item
          href="https://github.com/binance/binance-spot-api-docs/blob/master/web-socket-streams.md#how-to-manage-a-local-order-book-correctly">
          <span class="text-primary">Обратить внимание</span>
        </v-list-item>
        <v-list-item>
          Цены должны последовательно в стакане находиться + консистентность соблюдать
        </v-list-item>
      </v-list>

      <div class="text-subtitle-2 py-2">СТРАНИЦЫ</div>
      <v-list density="compact">
        <v-list-item>
          1) Страница с настройкой валютной пары и лог изменений.
          Реализовать селект с выбором валютной пары(Захардкодить список из BTCUSDT, BNBBTC, ETHBTC. По умолчанию
          выбрана
          BTCUSDT). При выборе обновляем данные в сторе(метод rest) и подключаемся по ws для обновления данных по
          валютной
          паре.
          Блок с логом наших действий по изменение валютной пары. С какой на какую мы изменили и во сколько времени.
        </v-list-item>
        <v-list-item>
          2) Страница с таблице(Order Book).
          Выводим две таблицы рядом для двух массивов(Bids и Asks) с колонками: Price, Quantity, Total(Price *
          Quantity). В
          мобильной версии отображать только две колонки(Price, Total).
          Селект с выбором кол-ва элементов в таблице(100, 500, 1000).
          Требования к таблицам: на десктопе и на мобилке вместе две таблицы не должны превышать высоту экрана
          устройства
          (Скрол должен быть внутри таблиц. При скроле шапка с разбивкой по колонкам должна оставаться на месте).
          С точки зрения стиля(цвета, скругления, отступы) всё на собственный взгляд, но что бы выглядело опрятно.
        </v-list-item>
      </v-list>
    </v-card>
  </v-container>
</template>

<script lang="ts" setup>
</script>
